{"data":{"site":{"siteMetadata":{"title":"Carsten's Blog","author":"Carsten Rudolph, M. Sc."}},"markdownRemark":{"id":"8e5598e7-529f-5eaf-b1ce-e34cadd4af5b","html":"<p>Tomorrow marks the day, the latest and long-awaited Rockstar Games title, Red Dead Redemption II will be released for Windows PC’s. Along with it comes the requirement to install Rockstar’s Game Launcher, which replaces the now obsolete Social Club application. Being a relatively young software product, the launcher is not free from issues. After I installed it, I ran into a reproducible connectivity problem. If you are also encountering such problems, you may give this solution a try!</p>\n<!-- end -->\n<h1>The Problem</h1>\n<p><a href=\"https://socialclub.rockstargames.com/rockstar-games-launcher\">Rockstar’s Game launcher</a> is the latest addition to the game launcher family, <a href=\"https://aschratt.github.io/devblog/game-pass-critic/\">we’ve all been waiting for</a>. Unfortunately, after installing it, I wasn’t able to get it running directly. I kept receiving the following error, directly after starting the application. The only options I had was to immediately close the app again.</p>\n<blockquote>\n<p>Connection to the Rockstar Games Library Service could not be established. In case you keep receiving this message, contact the customer support.</p>\n</blockquote>\n<p>\n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block; margin: 15px -30px !important max-width: 600px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 50%; position: relative; bottom: 0; left: 0; background-image: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAKCAIAAAA7N+mxAAAACXBIWXMAAA7DAAAOwwHHb6hkAAABcklEQVQoz42QW07CQBSG+8KLRulthple7CW0oYUipdMLhEQtYFyLKxNigkZfdAFuBjDFFXgYkAc1xuTr5Ms//5mZVKgWLWDznFYPrerequ7tf2B9vE6rp0RY3hnrRfT+crN+ZKuZuZrby9kWLtZyDnCZWZDw8Gw1dzZvt+tFVyhTvUzpOMElI+DjzODoHGMCCQ8nubnbmhYg+lUslYwKR6cN3Qo6vWHQLbyAeUHSaqd+CMLa3SLopEGUwRrFgzDK/CA2nVDB1nGdnkiaICuNMAyvx5ejYX4xGuRpf1iAFEXG4j5LWJamRZJkWTZIWJH3fN+mCG/BDRhWqWPSnq+3XC3y6LmvgXQ8zXc0jKmKNYQ03tZURDEmuEFBAEgE+GBelKmkUJEjfbErHYCmolJZIYpKwPfDfIMitH/PVjjfhuuighChVIfL63UZmgIco/7o/Qap1WqEENd1DcMAl2Qk2E7z8Iy/gSMkGYsSghV+s2U3PwGdVIC469458AAAAABJRU5ErkJggg=='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"Unable to connect to the Rockstar Games Library Service\"\n        title=\"\"\n        src=\"/static/error-80f812e0adb1165c0a95fd904a963996-d18ef.png\"\n        srcset=\"/static/error-80f812e0adb1165c0a95fd904a963996-2fc5d.png 175w,\n/static/error-80f812e0adb1165c0a95fd904a963996-31c00.png 350w,\n/static/error-80f812e0adb1165c0a95fd904a963996-d18ef.png 600w\"\n        sizes=\"(max-width: 600px) 100vw, 600px\"\n      />\n    </span>\n  </span>\n  </p>\n<p><small style=\"text-align: center;\">The error message (in german).</small></p>\n<p>Rockstar’s support website suggested to check the following requirements:</p>\n<ul>\n<li>Check if the Rockstar-Servers are working (they did)</li>\n<li>Check if the Router blocked connection (it didn’t)</li>\n<li>Check if the Firewall allows communication through the UDP ports 6672 and 61455-61458 (it did)</li>\n</ul>\n<p>I reached out to Rockstar Support and didn’t receive an answer at first. After a few days, I was informed about a delay, due to the unusual number of requests. Understandable, a week before the launch of one of the best-selling games in video game history, yet another inconvenience caused by restrictive DRM.</p>\n<h1>The Solution</h1>\n<p>First, I thought this was a networking issue and I think many people do, but after some debugging and research, it turned out that the <em>Rockstar Games Library Service</em> is actually a local Windows Service, the <em>Launcher</em> is connecting to. I tried starting it up manually and indeed, it refused to launch.</p>\n<p>I checked the service installation and found that the installer did not register the service correctly in some cases. Services in Windows are registered under the registry key <code class=\"language-text\">HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services</code>. Each service has an <code class=\"language-text\">ImagePath</code>, that contains the directory of the executable assembly, Windows calls when launching a service. This assembly is invoked through the standard shell, which commonly refuses to resolve path names that contain white spaces or are installed on different drives/partitions. In order to deal with this problem, the shell needs to be told that the whole string actually contains just <em>one, whole</em> name. This is done by escaping the string with quotation marks.</p>\n<h1>TL/DR - The Fix</h1>\n<p>There is a fool-proof and a proper fix. If you do not want (or are allowed) edit your registry files, your only option is to install the launcher to the default location (<code class=\"language-text\">C:\\Program Files\\Rockstar Games\\Launcher\\</code>).</p>\n<p>The proper fix is actually trivial: Run <code class=\"language-text\">regedit.exe</code> to edit your registry. Browse to <code class=\"language-text\">HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\Rockstar Service\\</code> and edit the <code class=\"language-text\">ImagePath</code> property by putting quotation marks (\"\") around the value, just like in this example:</p>\n<ul>\n<li>Default: <code class=\"language-text\">D:\\Program Files\\Rockstar Games\\Launcher\\RockstarService.exe</code></li>\n<li>Fixed: <code class=\"language-text\">&quot;D:\\Program Files\\Rockstar Games\\Launcher\\RockstarService.exe&quot;</code></li>\n</ul>\n<p>I’ve informed Rockstar Support about this fix and got an reply yesterday, where I was ensured that this will be fixed in future releases. Since I don’t think that a patch will be available at launch day and I am surely not the only one with this problem, I wanted to share this with you, so that you are able to enjoy Rockstar’s next masterpiece too.</p>\n<p>Have fun!</p>","frontmatter":{"title":"Fixing connectivity issues for Rockstar's Game Launcher","date":"November 04, 2019","featuredImage":null}}},"pageContext":{"slug":"/rs-launcher-connectivity-error/","previous":{"fields":{"slug":"/game-pass-critic/"},"excerpt":"\r\nThis years Electronic Entertainment Expo marks the current apex of a pretty questionable business model. EA has it for quite some time, Microsoft and Ubisoft are also joining in. The Netflix-Model, aka subscription-based services, are the latest craze and everybody wants to jump onto the train before the market is jaded. Meanwhile game streaming is re-entering the Gaming as a Service (GaaS) stage once again. With Stadia, xCloud and Orion, everybody wants their share. Promises are high: access the latest blockbuster titles on every device, keep your savegames synced and save money at the same time. \r\n\r\nBut are gaming services capable of holding up to their promises? This is a critical review of subscription-based gaming services and game streaming.\r\n\r\n","frontmatter":{"title":"The worrying Rise of Gaming Service Platforms","date":"June 13, 2019","featuredImage":{"childImageSharp":{"sizes":{"base64":"data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAKABQDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAAIDBf/EABUBAQEAAAAAAAAAAAAAAAAAAAAC/9oADAMBAAIQAxAAAAGZVJZYhb//xAAbEAACAgMBAAAAAAAAAAAAAAAAAgEDERIyNP/aAAgBAQABBQKpNpdzCwX+NuT/xAAVEQEBAAAAAAAAAAAAAAAAAAACEP/aAAgBAwEBPwECf//EABURAQEAAAAAAAAAAAAAAAAAAAIQ/9oACAECAQE/AQZ//8QAHRAAAQIHAAAAAAAAAAAAAAAAAAECEBIhMUFRsf/aAAgBAQAGPwKpK23TYi5HQ//EAB0QAAIDAAIDAAAAAAAAAAAAAAERACExQVFhgfD/2gAIAQEAAT8h1CQeSry6+ZCQiG5MqNSb7ghivuGf/9oADAMBAAIAAwAAABCoP//EABcRAQADAAAAAAAAAAAAAAAAAAEQEWH/2gAIAQMBAT8QMDS4/8QAFhEBAQEAAAAAAAAAAAAAAAAAAQAh/9oACAECAQE/ECZNv//EAB0QAQACAgIDAAAAAAAAAAAAAAERIQAxQXFhsfD/2gAIAQEAAT8QNVgkLV96cjJzINxrtfKO4jGiZFB241soBNMU31lDqcL1mzn/2Q==","aspectRatio":2,"src":"/static/header-f4642b47375fe6a36b1e4c79a59f0eca-0868d.jpg","srcSet":"/static/header-f4642b47375fe6a36b1e4c79a59f0eca-7dfb1.jpg 213w,\n/static/header-f4642b47375fe6a36b1e4c79a59f0eca-61f0d.jpg 425w,\n/static/header-f4642b47375fe6a36b1e4c79a59f0eca-0868d.jpg 800w","sizes":"(max-width: 800px) 100vw, 800px"}}}}},"next":null}}